Revit 2027 API
DividedPath.IsCurveReferenceValid Method
 This returns true if the reference represents a curve or edge that can be used to create a divided path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsCurveReferenceValid(
	Document document,
	Reference curveReference
)
Public Shared Function IsCurveReferenceValid (
	document As Document,
	curveReference As Reference
) As Boolean
public:
static bool IsCurveReferenceValid(
	Document^ document,
	Reference^ curveReference
)
static member IsCurveReferenceValid :
        document : Document *
        curveReference : Reference -> bool
Parameters
document Document
 The document.
curveReference Reference
 The reference.
Return Value
Boolean
 True if the reference can be used to create a divided path, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace